# データサイエンス100本ノック（構造化データ加工編） - SQL

## はじめに
- データベースはPostgreSQL13です
- 初めに以下のセルを実行してください
- セルに %%sql と記載することでSQLを発行することができます
- jupyterからはdescribeコマンドによるテーブル構造の確認ができないため、テーブル構造を確認する場合はlimitを指定したSELECTなどで代用してください
- 使い慣れたSQLクライアントを使っても問題ありません（接続情報は以下の通り）
  - IPアドレス：Docker Desktopの場合はlocalhost、Docker toolboxの場合は192.168.99.100
  - Port:5432
  - database名: dsdojo_db
  - ユーザ名：padawan
  - パスワード:padawan12345
- 大量出力を行うとJupyterが固まることがあるため、出力件数は制限することを推奨します（設問にも出力件数を記載）
    - 結果確認のために表示させる量を適切にコントロールし、作業を軽快にすすめる技術もデータ加工には求められます
- 大量結果が出力された場合は、ファイルが重くなり以降開けなくなることもあります
    - その場合、作業結果は消えますがファイルをGitHubから取り直してください
    - vimエディタなどで大量出力範囲を削除することもできます
- 名前、住所等はダミーデータであり、実在するものではありません

In [1]:
%load_ext sql
import os

pgconfig = {
    'host': 'db',
    'port': os.environ['PG_PORT'],
    'database': os.environ['PG_DATABASE'],
    'user': os.environ['PG_USER'],
    'password': os.environ['PG_PASSWORD'],
}
dsl = 'postgresql://{user}:{password}@{host}:{port}/{database}'.format(**pgconfig)

# MagicコマンドでSQLを書くための設定
%sql $dsl

'Connected: padawan@dsdojo_db'

# 使い方
- セルの先頭に%%sqlと記載し、２行目以降にSQLを記述することでJupyterからPostgreSQLに対しSQLを実行できます。

In [2]:
%%sql
select 'このように実行できます' as sample

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[('このように実行できます',)]

# データ加工100本ノック

---
> S-001: レシート明細テーブル（receipt）から全項目の先頭10件を表示し、どのようなデータを保有しているか目視で確認せよ。

In [3]:
%%sql

SELECT * FROM receipt LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20181103, 1541203200, 'S14006', 112, 1, 'CS006214000001', 'P070305012', 1, 158),
 (20181118, 1542499200, 'S13008', 1132, 2, 'CS008415000097', 'P070701017', 1, 81),
 (20170712, 1499817600, 'S14028', 1102, 1, 'CS028414000014', 'P060101005', 1, 170),
 (20190205, 1549324800, 'S14042', 1132, 1, 'ZZ000000000000', 'P050301001', 1, 25),
 (20180821, 1534809600, 'S14025', 1102, 2, 'CS025415000050', 'P060102007', 1, 90),
 (20190605, 1559692800, 'S13003', 1112, 1, 'CS003515000195', 'P050102002', 1, 138),
 (20181205, 1543968000, 'S14024', 1102, 2, 'CS024514000042', 'P080101005', 1, 30),
 (20190922, 1569110400, 'S14040', 1102, 1, 'CS040415000178', 'P070501004', 1, 128),
 (20170504, 1493856000, 'S13020', 1112, 2, 'ZZ000000000000', 'P071302010', 1, 770),
 (20191010, 1570665600, 'S14027', 1102, 1, 'CS027514000015', 'P071101003', 1, 680)]

---
> S-002: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、10件表示させよ。

In [4]:
%%sql

SELECT sales_ymd, customer_id, product_cd, amount FROM receipt LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20181103, 'CS006214000001', 'P070305012', 158),
 (20181118, 'CS008415000097', 'P070701017', 81),
 (20170712, 'CS028414000014', 'P060101005', 170),
 (20190205, 'ZZ000000000000', 'P050301001', 25),
 (20180821, 'CS025415000050', 'P060102007', 90),
 (20190605, 'CS003515000195', 'P050102002', 138),
 (20181205, 'CS024514000042', 'P080101005', 30),
 (20190922, 'CS040415000178', 'P070501004', 128),
 (20170504, 'ZZ000000000000', 'P071302010', 770),
 (20191010, 'CS027514000015', 'P071101003', 680)]

---
> S-003: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、10件表示させよ。ただし、sales_ymdはsales_dateに項目名を変更しながら抽出すること。

In [5]:
%%sql

SELECT sales_ymd as sales_date, customer_id, product_cd, amount 
FROM receipt LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20181103, 'CS006214000001', 'P070305012', 158),
 (20181118, 'CS008415000097', 'P070701017', 81),
 (20170712, 'CS028414000014', 'P060101005', 170),
 (20190205, 'ZZ000000000000', 'P050301001', 25),
 (20180821, 'CS025415000050', 'P060102007', 90),
 (20190605, 'CS003515000195', 'P050102002', 138),
 (20181205, 'CS024514000042', 'P080101005', 30),
 (20190922, 'CS040415000178', 'P070501004', 128),
 (20170504, 'ZZ000000000000', 'P071302010', 770),
 (20191010, 'CS027514000015', 'P071101003', 680)]

---
> S-004: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"

In [6]:
%%sql

SELECT
    sales_ymd as sales_date, customer_id, product_cd, amount
FROM
    receipt
WHERE
    customer_id = 'CS018205000001'

 * postgresql://padawan:***@db:5432/dsdojo_db
12 rows affected.

[(20180911, 'CS018205000001', 'P071401012', 2200),
 (20180414, 'CS018205000001', 'P060104007', 600),
 (20170614, 'CS018205000001', 'P050206001', 990),
 (20170614, 'CS018205000001', 'P060702015', 108),
 (20190216, 'CS018205000001', 'P071005024', 102),
 (20180414, 'CS018205000001', 'P071101002', 278),
 (20190226, 'CS018205000001', 'P070902035', 168),
 (20190924, 'CS018205000001', 'P060805001', 495),
 (20190226, 'CS018205000001', 'P071401020', 2200),
 (20180911, 'CS018205000001', 'P071401005', 1100),
 (20190216, 'CS018205000001', 'P040101002', 218),
 (20190924, 'CS018205000001', 'P091503001', 280)]

---
> S-005: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上

In [7]:
%%sql

SELECT
    sales_ymd as sales_date, customer_id, product_cd, amount
FROM
    receipt
WHERE
    customer_id = 'CS018205000001'
    and
    amount >= 1000

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[(20180911, 'CS018205000001', 'P071401012', 2200),
 (20190226, 'CS018205000001', 'P071401020', 2200),
 (20180911, 'CS018205000001', 'P071401005', 1100)]

---
> S-006: レシート明細テーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上数量（quantity）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上または売上数量（quantity）が5以上

In [8]:
%%sql

SELECT
    sales_ymd as sales_date, customer_id, product_cd, quantity, amount
FROM
    receipt
WHERE
    customer_id = 'CS018205000001'
    and
    (
        amount >= 1000
        or
        quantity >= 5
    )

 * postgresql://padawan:***@db:5432/dsdojo_db
5 rows affected.

[(20180911, 'CS018205000001', 'P071401012', 1, 2200),
 (20180414, 'CS018205000001', 'P060104007', 6, 600),
 (20170614, 'CS018205000001', 'P050206001', 5, 990),
 (20190226, 'CS018205000001', 'P071401020', 1, 2200),
 (20180911, 'CS018205000001', 'P071401005', 1, 1100)]

---
> S-007: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上2,000以下

In [9]:
%%sql

SELECT
    sales_ymd as sales_date, customer_id, product_cd, amount
FROM
    receipt
WHERE
    customer_id = 'CS018205000001'
    and
    amount between 1000 and 2000

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(20180911, 'CS018205000001', 'P071401005', 1100)]

---
> S-008: レシート明細テーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 商品コード（product_cd）が"P071401019"以外

In [ ]:
%%sql

SELECT
    sales_ymd as sales_date, customer_id, product_cd, amount
FROM
    receipt
WHERE
    customer_id = 'CS018205000001'
    and
    product_cd != 'P071401019'

---
> S-009: 以下の処理において、出力結果を変えずにORをANDに書き換えよ。

`select * from store where not (prefecture_cd = '13' or floor_area > 900)`

In [ ]:
%%sql

SELECT * FROM store WHERE prefecture_cd != '13' and floor_area <= 900

---
> S-010: 店舗テーブル（store）から、店舗コード（store_cd）が"S14"で始まるものだけ全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

SELECT * FROM store WHERE store_cd like 'S14%' LIMIT 10

---
> S-011: 顧客テーブル（customer）から顧客ID（customer_id）の末尾が1のものだけ全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

SELECT * FROM customer WHERE customer_id like '%1' LIMIT 10

---
> S-012: 店舗テーブル（store）から横浜市の店舗だけ全項目表示せよ。

In [ ]:
%%sql

SELECT * FROM store WHERE address LIKE '%横浜市%'

---
> S-013: 顧客テーブル（customer）から、ステータスコード（status_cd）の先頭がアルファベットのA〜Fで始まるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

SELECT * FROM customer WHERE status_cd ~ '^[A-F]' LIMIT 10

---
> S-014: 顧客テーブル（customer）から、ステータスコード（status_cd）の末尾が数字の1〜9で終わるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

SELECT * FROM customer WHERE status_cd ~ '[1-9]$' LIMIT 10

---
> S-015: 顧客テーブル（customer）から、ステータスコード（status_cd）の先頭がアルファベットのA〜Fで始まり、末尾が数字の1〜9で終わるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

SELECT * FROM customer WHERE status_cd ~ '^[A-F].*[1-9]$' LIMIT 10

---
> S-016: 店舗テーブル（store）から、電話番号（tel_no）が3桁-3桁-4桁のデータを全項目表示せよ。

In [ ]:
%%sql

SELECT * FROM store WHERE tel_no ~ '^[0-9]{3}-[0-9]{3}-[0-9]{4}$'

---
> S-017: 顧客テーブル（customer）を生年月日（birth_day）で高齢順にソートし、先頭10件を全項目表示せよ。

In [ ]:
%%sql

SELECT * from customer ORDER BY birth_day LIMIT 10

---
> S-018: 顧客テーブル（customer）を生年月日（birth_day）で若い順にソートし、先頭10件を全項目表示せよ。

In [ ]:
%%sql

SELECT * from customer ORDER BY birth_day DESC LIMIT 10

---
> S-019: レシート明細テーブル（receipt）に対し、1件あたりの売上金額（amount）が高い順にランクを付与し、先頭10件を抽出せよ。項目は顧客ID（customer_id）、売上金額（amount）、付与したランクを表示させること。なお、売上金額（amount）が等しい場合は同一順位を付与するものとする。

In [ ]:
%%sql

SELECT customer_id, amount, RANK() OVER(ORDER BY amount DESC) AS ranking 
FROM receipt
LIMIT 10

---
>  S-020: レシート明細テーブル（receipt）に対し、1件あたりの売上金額（amount）が高い順にランクを付与し、先頭10件を抽出せよ。項目は顧客ID（customer_id）、売上金額（amount）、付与したランクを表示させること。なお、売上金額（amount）が等しい場合でも別順位を付与すること。

In [ ]:
%%sql

SELECT customer_id, amount, ROW_NUMBER() OVER(ORDER BY amount DESC) AS ranking 
FROM receipt
LIMIT 10

---
> S-021: レシート明細テーブル（receipt）に対し、件数をカウントせよ。

In [ ]:
%%sql

SELECT count(1) FROM receipt

---
> S-022: レシート明細テーブル（receipt）の顧客ID（customer_id）に対し、ユニーク件数をカウントせよ。

In [ ]:
%%sql

SELECT count(distinct customer_id) FROM receipt

---
> S-023: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）と売上数量（quantity）を合計せよ。

In [ ]:
%%sql

SELECT store_cd
    , SUM(amount) as amount
    , SUM(quantity) as quantity
FROM receipt
group by store_cd

---
> S-024: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も新しい売上日（sales_ymd）を求め、10件表示せよ。

In [ ]:
%%sql

SELECT customer_id, MAX(sales_ymd)
FROM receipt
GROUP BY customer_id
LIMIT 10

---
> S-025: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も古い売上日（sales_ymd）を求め、10件表示せよ。

In [ ]:
%%sql

SELECT customer_id, MIN(sales_ymd)
FROM receipt
GROUP BY customer_id
LIMIT 10

---
> S-026: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も新しい売上日（sales_ymd）と古い売上日を求め、両者が異なるデータを10件表示せよ。

In [ ]:
%%sql

SELECT customer_id, MAX(sales_ymd), MIN(sales_ymd)
FROM receipt
GROUP BY customer_id
HAVING MAX(sales_ymd) != MIN(sales_ymd)
LIMIT 10

---
> S-027: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の平均を計算し、降順でTOP5を表示せよ。

In [ ]:
%%sql

SELECT store_cd, AVG(amount) as avr_amount
FROM receipt
GROUP BY store_cd
ORDER BY avr_amount DESC
LIMIT 5

---
> S-028: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の中央値を計算し、降順でTOP5を表示せよ。

In [ ]:
%%sql

SELECT 
    store_cd, 
    PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY amount) as amount_50per
FROM receipt
GROUP BY store_cd
ORDER BY amount_50per desc
LIMIT 5

---
> S-029: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに商品コード（product_cd）の最頻値を求めよ。

In [ ]:
%%sql

-- コード例1: 分析関数でmodeを計算する
WITH product_mode AS (
    SELECT store_cd,product_cd, COUNT(1) as mode_cnt,
        RANK() OVER(PARTITION BY store_cd ORDER BY COUNT(1) DESC) AS rnk
    FROM receipt
    GROUP BY store_cd,product_cd
)
SELECT store_cd,product_cd, mode_cnt
FROM product_mode
WHERE rnk = 1
ORDER BY store_cd,product_cd;

In [ ]:
%%sql

-- コード例2:mode()を使う簡易ケース（早いが最頻値が複数の場合は一つだけ選ばれる）
SELECT store_cd, mode() WITHIN GROUP(ORDER BY product_cd)
FROM receipt
GROUP BY store_cd
ORDER BY store_cd

---
> S-030: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の標本分散を計算し、降順でTOP5を表示せよ。

In [ ]:
%%sql

SELECT store_cd, var_samp(amount) as vars_amount
FROM receipt
GROUP BY store_cd
ORDER BY vars_amount desc 
LIMIT 5

---
> S-031: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の標本標準偏差を計算し、降順でTOP5を表示せよ。

In [ ]:
%%sql

SELECT store_cd, stddev_samp(amount) as stds_amount
FROM receipt
GROUP BY store_cd
ORDER BY stds_amount desc
LIMIT 5

---
> S-032: レシート明細テーブル（receipt）の売上金額（amount）について、25％刻みでパーセンタイル値を求めよ。

In [ ]:
%%sql

SELECT
    PERCENTILE_CONT(0.25) WITHIN GROUP(ORDER BY amount) as amount_25per,
    PERCENTILE_CONT(0.50) WITHIN GROUP(ORDER BY amount) as amount_50per,
    PERCENTILE_CONT(0.75) WITHIN GROUP(ORDER BY amount) as amount_75per,
    PERCENTILE_CONT(1.0) WITHIN GROUP(ORDER BY amount) as amount_100per
FROM receipt

---
> S-033: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の平均を計算し、330以上のものを抽出せよ。

In [ ]:
%%sql

SELECT store_cd, AVG(amount) as avg_amount
FROM receipt
GROUP BY store_cd
HAVING AVG(amount) >= 330

---
> S-034: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに売上金額（amount）を合計して全顧客の平均を求めよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。

In [ ]:
%%sql

WITH customer_amount AS (
    SELECT customer_id, SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id not like 'Z%'
    GROUP BY customer_id
)
SELECT AVG(sum_amount) from customer_amount

---
> S-035: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに販売金額（amount）を合計して全顧客の平均を求め、平均以上に買い物をしている顧客を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、データは10件だけ表示させれば良い。

In [ ]:
%%sql

WITH customer_amount AS (
    SELECT customer_id, SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id not like 'Z%'
    GROUP BY customer_id
)
SELECT customer_id, sum_amount
FROM customer_amount
WHERE sum_amount >= (SELECT AVG(sum_amount) from customer_amount)
limit 10

---
> S-036: レシート明細テーブル（receipt）と店舗テーブル（store）を内部結合し、レシート明細テーブルの全項目と店舗テーブルの店舗名（store_name）を10件表示させよ。

In [ ]:
%%sql

SELECT r.*, s.store_name
FROM receipt r
JOIN store s
ON r.store_cd = s.store_cd
LIMIT 10

---
> S-037: 商品テーブル（product）とカテゴリテーブル（category）を内部結合し、商品テーブルの全項目とカテゴリテーブルの小区分名（category_small_name）を10件表示させよ。

In [ ]:
%%sql

SELECT p.*, c.category_small_name
FROM product p
JOIN category c
on p.category_small_cd = c.category_small_cd
LIMIT 10

---
> S-038: 顧客テーブル（customer）とレシート明細テーブル（receipt）から、各顧客ごとの売上金額合計を求めよ。ただし、買い物の実績がない顧客については売上金額を0として表示させること。また、顧客は性別コード（gender_cd）が女性（1）であるものを対象とし、非会員（顧客IDが'Z'から始まるもの）は除外すること。なお、結果は10件だけ表示させれば良い。

In [ ]:
%%sql

WITH customer_amount AS (
    SELECT customer_id, SUM(amount) AS sum_amount
    FROM receipt
    GROUP BY customer_id
)
SELECT c.customer_id, COALESCE(a.sum_amount,0)
FROM customer c
LEFT JOIN customer_amount a
ON c.customer_id = a.customer_id
WHERE c.gender_cd = '1'
      and c.customer_id not like 'Z%'
LIMIT 10

---
> S-039: レシート明細テーブル（receipt）から売上日数の多い顧客の上位20件と、売上金額合計の多い顧客の上位20件を抽出し、完全外部結合せよ。ただし、非会員（顧客IDが'Z'から始まるもの）は除外すること。

In [ ]:
%%sql

WITH customer_days AS (
    select customer_id, count(distinct sales_ymd) come_days
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
    ORDER BY come_days DESC LIMIT 20
),
customer_amount AS (
    SELECT customer_id, sum(amount) buy_amount
    FROM receipt 
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
    ORDER BY buy_amount DESC LIMIT 20
)
SELECT COALESCE(d.customer_id, a.customer_id), d.come_days, a.buy_amount
FROM customer_days d
FULL JOIN customer_amount a
ON d.customer_id = a.customer_id;

---
> S-040: 全ての店舗と全ての商品を組み合わせると何件のデータとなるか調査したい。店舗（store）と商品（product）を直積した件数を計算せよ。

In [ ]:
%%sql

SELECT COUNT(1) FROM store CROSS JOIN product;

---
> S-041: レシート明細テーブル（receipt）の売上金額（amount）を日付（sales_ymd）ごとに集計し、前日からの売上金額増減を計算せよ。なお、計算結果は10件表示すればよい。

In [ ]:
%%sql

WITH sales_amount_by_date AS (
    SELECT sales_ymd, SUM(amount) as amount FROM receipt
    GROUP BY sales_ymd
    ORDER BY sales_ymd
)
SELECT sales_ymd, LAG(sales_ymd, 1) OVER(ORDER BY sales_ymd) lag_ymd,
    amount,
    LAG(amount, 1) OVER(ORDER BY sales_ymd) as lag_amount,
    amount - LAG(amount, 1) OVER(ORDER BY sales_ymd) as diff_amount
FROM sales_amount_by_date
LIMIT 10;

---
> S-042: レシート明細テーブル（receipt）の売上金額（amount）を日付（sales_ymd）ごとに集計し、各日付のデータに対し、１日前、２日前、３日前のデータを結合せよ。結果は10件表示すればよい。

In [ ]:
%%sql

-- コード例1:縦持ちケース
WITH sales_amount_by_date AS (
    SELECT sales_ymd, SUM(amount) as amount FROM receipt
    GROUP BY sales_ymd
    ORDER BY sales_ymd
),
sales_amount_lag_date AS (
    SELECT sales_ymd,
        COALESCE(LAG(sales_ymd, 3) OVER (ORDER BY sales_ymd),
        MIN(sales_ymd) OVER (PARTITION BY NULL)) as lag_date_3,
        amount
    FROM sales_amount_by_date
)
SELECT a.sales_ymd, b.sales_ymd as lag_ymd,
    a.amount as amount, b.amount as lag_amount
FROM sales_amount_lag_date a
JOIN sales_amount_lag_date b
ON b.sales_ymd >= a.lag_date_3 
    and b.sales_ymd < a.sales_ymd
ORDER BY sales_ymd, lag_ymd
LIMIT 10;

In [ ]:
%%sql

-- コード例2:横持ちケース
WITH sales_amount_by_date AS (
    SELECT sales_ymd, SUM(amount) as amount FROM receipt
    GROUP BY sales_ymd
    ORDER BY sales_ymd
), sales_amount_with_lag AS(
SELECT sales_ymd, amount, 
    LAG(sales_ymd, 1) OVER (ORDER BY sales_ymd) as lag_ymd_1,
    LAG(amount, 1) OVER (ORDER BY sales_ymd) as lag_amount_1,
    LAG(sales_ymd, 2) OVER (ORDER BY sales_ymd) as lag_ymd_2,
    LAG(amount, 2) OVER (ORDER BY sales_ymd) as lag_amount_2,
    LAG(sales_ymd, 3) OVER (ORDER BY sales_ymd) as lag_ymd_3,
    LAG(amount, 3) OVER (ORDER BY sales_ymd) as lag_amount_3
FROM sales_amount_by_date
)
SELECT * FROM sales_amount_with_lag
WHERE lag_ymd_3 IS NOT NULL
ORDER BY sales_ymd
LIMIT 10;

---
> S-043: レシート明細テーブル（receipt）と顧客テーブル（customer）を結合し、性別（gender）と年代（ageから計算）ごとに売上金額（amount）を合計した売上サマリテーブル（sales_summary）を作成せよ。性別は0が男性、1が女性、9が不明を表すものとする。
>
>ただし、項目構成は年代、女性の売上金額、男性の売上金額、性別不明の売上金額の4項目とすること（縦に年代、横に性別のクロス集計）。また、年代は10歳ごとの階級とすること。

In [ ]:
%%sql

-- SQL向きではないため、やや強引に記載する（カテゴリ数が多いときはとても長いSQLとなってしまう点に注意）

DROP TABLE IF EXISTS sales_summary;

CREATE TABLE sales_summary AS
    WITH gender_era_amount AS (
        SELECT c.gender_cd,
        TRUNC(age/ 10) * 10 AS era,
        SUM(r.amount) AS amount
        FROM customer c
        JOIN receipt r
        ON c.customer_id = r.customer_id
        GROUP BY c.gender_cd, era
    )
    select era,
        MAX(CASE gender_cd WHEN '0' THEN amount ELSE 0 END) AS male ,
        MAX(CASE gender_cd WHEN '1' THEN amount ELSE 0 END) AS female,
        MAX(CASE gender_cd WHEN '9' THEN amount ELSE 0 END) AS unknown
    FROM gender_era_amount
    GROUP BY era
    ORDER BY era
;

In [ ]:
%%sql

SELECT * FROM sales_summary;

---
> S-044: 前設問で作成した売上サマリテーブル（sales_summary）は性別の売上を横持ちさせたものであった。このテーブルから性別を縦持ちさせ、年代、性別コード、売上金額の3項目に変換せよ。ただし、性別コードは男性を'00'、女性を'01'、不明を'99'とする。

In [ ]:
%%sql

-- SQL向きではないため、やや強引に記載する（カテゴリ数が多いときはとても長いSQLとなってしまう点に注意）
SELECT era, '00' as gender_cd , male AS amount FROM sales_summary
UNION ALL
SELECT era, '01' as gender_cd, female AS amount FROM sales_summary
UNION ALL
SELECT era, '99' as gender_cd, unknown AS amount FROM sales_summary

---
> S-045: 顧客テーブル（customer）の生年月日（birth_day）は日付型でデータを保有している。これをYYYYMMDD形式の文字列に変換し、顧客ID（customer_id）とともに抽出せよ。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT customer_id, TO_CHAR(birth_day, 'YYYYMMDD') FROM customer LIMIT 10;

---
> S-046: 顧客テーブル（customer）の申し込み日（application_date）はYYYYMMDD形式の文字列型でデータを保有している。これを日付型に変換し、顧客ID（customer_id）とともに抽出せよ。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT customer_id, TO_DATE(application_date, 'YYYYMMDD') 
FROM customer LIMIT 10;

---
> S-047: レシート明細テーブル（receipt）の売上日（sales_ymd）はYYYYMMDD形式の数値型でデータを保有している。これを日付型に変換し、レシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT 
    TO_DATE(CAST(sales_ymd AS VARCHAR), 'YYYYMMDD'), 
    receipt_no, 
    receipt_sub_no 
FROM receipt 
LIMIT 10;

---
> S-048: レシート明細テーブル（receipt）の売上エポック秒（sales_epoch）は数値型のUNIX秒でデータを保有している。これを日付型に変換し、レシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT 
    TO_TIMESTAMP(sales_epoch) as sales_date, 
    receipt_no, receipt_sub_no 
FROM receipt 
LIMIT 10;

---
> S-049: レシート明細テーブル（receipt）の販売エポック秒（sales_epoch）を日付型に変換し、「年」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT 
    TO_CHAR(EXTRACT(YEAR FROM TO_TIMESTAMP(sales_epoch)),'FM9999') as sales_year, 
    receipt_no, 
    receipt_sub_no
FROM receipt 
LIMIT 10;

---
> S-050: レシート明細テーブル（receipt）の売上エポック秒（sales_epoch）を日付型に変換し、「月」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。なお、「月」は0埋め2桁で取り出すこと。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT 
    TO_CHAR(EXTRACT(
        MONTH FROM TO_TIMESTAMP(sales_epoch)
    ), 'FM00') as sales_month, 
    receipt_no, receipt_sub_no
FROM receipt LIMIT 10;

---
> S-051: レシート明細テーブル（receipt）の売上エポック秒を日付型に変換し、「日」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。なお、「日」は0埋め2桁で取り出すこと。データは10件を抽出すれば良い。

In [ ]:
%%sql

SELECT 
    receipt_no, receipt_sub_no,
    TO_CHAR(EXTRACT(DAY FROM TO_TIMESTAMP(sales_epoch)), 'FM00') as sales_day
FROM receipt LIMIT 10;

---
> S-052: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計の上、売上金額合計に対して2,000円以下を0、2,000円より大きい金額を1に2値化し、顧客ID、売上金額合計とともに10件表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。

In [ ]:
%%sql

SELECT
    customer_id,
    SUM(amount) AS sum_amount,
    CASE
        WHEN SUM(amount)  > 2000 THEN 1
        WHEN SUM(amount) <= 2000 THEN 0
    END as amount_flg
FROM receipt
WHERE customer_id not like 'Z%'
GROUP BY customer_id
LIMIT 10

---
> S-053: 顧客テーブル（customer）の郵便番号（postal_cd）に対し、東京（先頭3桁が100〜209のもの）を1、それ以外のものを0に２値化せよ。さらにレシート明細テーブル（receipt）と結合し、全期間において買い物実績のある顧客数を、作成した2値ごとにカウントせよ。

In [ ]:
%%sql

WITH cust AS (
    SELECT
        customer_id,
        postal_cd,
        CASE
            WHEN 100 <= CAST(SUBSTR(postal_cd, 1, 3) AS INTEGER) 
                    AND CAST(SUBSTR(postal_cd, 1, 3) AS INTEGER) <= 209 THEN 1
            ELSE 0
        END AS postal_flg
    FROM customer
),
rect AS(
    SELECT
        customer_id,
        SUM(amount)
    FROM
        receipt
    GROUP BY
        customer_id
)
SELECT 
    c.postal_flg, count(1) 
FROM
    rect r
JOIN
    cust c
ON
    r.customer_id = c.customer_id
GROUP BY
    c.postal_flg

---
> S-054: 顧客テーブル（customer）の住所（address）は、埼玉県、千葉県、東京都、神奈川県のいずれかとなっている。都道府県毎にコード値を作成し、顧客ID、住所とともに抽出せよ。値は埼玉県を11、千葉県を12、東京都を13、神奈川県を14とすること。結果は10件表示させれば良い。

In [59]:
%%sql

-- SQL向きではないため、やや強引に記載する（カテゴリ数が多いときはとても長いSQLとなってしまう点に注意）
SELECT
    customer_id,
    -- 確認用に住所も表示
    address,
    CASE SUBSTR(address,1, 3)
        WHEN '埼玉県' THEN '11'
        WHEN '千葉県' THEN '12'
        WHEN '東京都' THEN '13'
        WHEN '神奈川' THEN '14'
    END AS prefecture_cd
FROM
    customer
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', '神奈川県伊勢原市粟窪**********', '14'),
 ('CS037613000071', '東京都江東区南砂**********', '13'),
 ('CS031415000172', '東京都渋谷区代々木**********', '13'),
 ('CS028811000001', '神奈川県横浜市泉区和泉町**********', '14'),
 ('CS001215000145', '東京都大田区仲六郷**********', '13'),
 ('CS020401000016', '東京都板橋区若木**********', '13'),
 ('CS015414000103', '東京都江東区北砂**********', '13'),
 ('CS029403000008', '千葉県浦安市海楽**********', '12'),
 ('CS015804000004', '東京都江東区北砂**********', '13'),
 ('CS033513000180', '神奈川県横浜市旭区善部町**********', '14')]

---
> S-055: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、その合計金額の四分位点を求めよ。その上で、顧客ごとの売上金額合計に対して以下の基準でカテゴリ値を作成し、顧客ID、売上金額合計とともに表示せよ。カテゴリ値は上から順に1〜4とする。結果は10件表示させれば良い。
>
> - 最小値以上第一四分位未満
> - 第一四分位以上第二四分位未満
> - 第二四分位以上第三四分位未満
> - 第三四分位以上

In [60]:
%%sql

WITH sales_amount AS(
    SELECT
        customer_id,
        SUM(amount) as sum_amount
    FROM
        receipt
    GROUP BY
        customer_id
),
sales_pct AS (
    SELECT
        PERCENTILE_CONT(0.25) WITHIN GROUP(ORDER BY sum_amount) AS pct25,
        PERCENTILE_CONT(0.50) WITHIN GROUP(ORDER BY sum_amount) AS pct50,
        PERCENTILE_CONT(0.75) WITHIN GROUP(ORDER BY sum_amount) AS pct75
    FROM
        sales_amount
)
SELECT
    a.customer_id,
    a.sum_amount,
    CASE
        WHEN a.sum_amount < pct25 THEN 1
        WHEN pct25 <= a.sum_amount and a.sum_amount < pct50 THEN 2
        WHEN pct50 <= a.sum_amount and a.sum_amount < pct75 THEN 3
        WHEN pct75 <= a.sum_amount THEN 4
    END as pct_flg
FROM sales_amount a
CROSS JOIN sales_pct p
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 3),
 ('CS004614000122', 248, 1),
 ('CS003512000043', 298, 1),
 ('CS011615000061', 246, 1),
 ('CS029212000033', 3604, 3),
 ('CS007515000119', 7157, 4),
 ('CS034515000123', 3699, 4),
 ('CS004315000058', 490, 1),
 ('CS026414000014', 6671, 4),
 ('CS001615000099', 768, 2)]

---
> S-056: 顧客テーブル（customer）の年齢（age）をもとに10歳刻みで年代を算出し、顧客ID（customer_id）、生年月日（birth_day）とともに抽出せよ。ただし、60歳以上は全て60歳代とすること。年代を表すカテゴリ名は任意とする。先頭10件を表示させればよい。

In [61]:
%%sql

SELECT
    customer_id,
    birth_day,
    LEAST(CAST(TRUNC(age / 10) * 10 AS INTEGER), 60) AS era
FROM
    customer
GROUP BY
    customer_id,
    birth_day
    -- 確認用の条件
    --HAVING LEAST(CAST(TRUNC(age / 10) * 10 AS INTEGER), 60) >= 60
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001105000001', datetime.date(2000, 1, 14), 10),
 ('CS001112000009', datetime.date(2006, 8, 24), 10),
 ('CS001112000019', datetime.date(2001, 1, 31), 10),
 ('CS001112000021', datetime.date(2001, 12, 15), 10),
 ('CS001112000023', datetime.date(2004, 1, 26), 10),
 ('CS001112000024', datetime.date(2001, 1, 16), 10),
 ('CS001112000029', datetime.date(2005, 1, 24), 10),
 ('CS001112000030', datetime.date(2003, 3, 2), 10),
 ('CS001113000004', datetime.date(2003, 2, 22), 10),
 ('CS001113000010', datetime.date(2005, 5, 9), 10)]

---
> S-057: 前問題の抽出結果と性別（gender）を組み合わせ、新たに性別×年代の組み合わせを表すカテゴリデータを作成せよ。組み合わせを表すカテゴリの値は任意とする。先頭10件を表示させればよい。

In [62]:
%%sql

SELECT
    customer_id,
    birth_day,
    gender_cd || LEAST(CAST(TRUNC(age / 10) * 10 AS INTEGER), 60) AS era
FROM
    customer
GROUP BY
    customer_id,
    birth_day
HAVING LEAST(CAST(TRUNC(age / 10) * 10 AS INTEGER), 60) >= 60
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001413000478', datetime.date(1953, 1, 29), '160'),
 ('CS001413000794', datetime.date(1939, 10, 9), '160'),
 ('CS001415000389', datetime.date(1933, 10, 8), '160'),
 ('CS001501000030', datetime.date(1940, 7, 1), '060'),
 ('CS001512000067', datetime.date(1959, 1, 4), '160'),
 ('CS001512000326', datetime.date(1959, 2, 17), '960'),
 ('CS001512000368', datetime.date(1959, 3, 23), '160'),
 ('CS001512000417', datetime.date(1959, 1, 20), '160'),
 ('CS001512000436', datetime.date(1953, 2, 13), '160'),
 ('CS001513000035', datetime.date(1958, 12, 10), '160')]

---
> S-058: 顧客テーブル（customer）の性別コード（gender_cd）をダミー変数化し、顧客ID（customer_id）とともに抽出せよ。結果は10件表示させれば良い。

In [63]:
%%sql

-- SQL向きではないため、やや強引に記載する（カテゴリ数が多いときはとても長いSQLとなってしまう点に注意）
SELECT
    customer_id,
    CASE WHEN gender_cd = '0' THEN '1' ELSE '0' END AS gender_male,
    CASE WHEN gender_cd = '1' THEN '1' ELSE '0' END AS gender_female,
    CASE WHEN gender_cd = '9' THEN '1' ELSE '0' END AS gender_unknown
FROM
    customer
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', '0', '1', '0'),
 ('CS037613000071', '0', '0', '1'),
 ('CS031415000172', '0', '1', '0'),
 ('CS028811000001', '0', '1', '0'),
 ('CS001215000145', '0', '1', '0'),
 ('CS020401000016', '1', '0', '0'),
 ('CS015414000103', '0', '1', '0'),
 ('CS029403000008', '1', '0', '0'),
 ('CS015804000004', '1', '0', '0'),
 ('CS033513000180', '0', '1', '0')]

---
> S-059: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を平均0、標準偏差1に標準化して顧客ID、売上金額合計とともに表示せよ。標準化に使用する標準偏差は、不偏標準偏差と標本標準偏差のどちらでも良いものとする。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [64]:
%%sql

WITH sales_amount AS(
    SELECT
        customer_id,
        SUM(amount) as sum_amount
    FROM
        receipt
    WHERE
        customer_id NOT LIKE 'Z%'
    GROUP BY
        customer_id
),
stats_amount AS (
    SELECT
        AVG(sum_amount) as avg_amount,
        stddev_samp(sum_amount) as std_amount
    FROM
        sales_amount
)
SELECT
    customer_id,
    sum_amount,
    (sum_amount - avg_amount) / std_amount as normal_amount
FROM sales_amount
CROSS JOIN stats_amount
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, Decimal('-0.09032402671702291270')),
 ('CS004614000122', 248, Decimal('-0.84528400025253654164')),
 ('CS003512000043', 298, Decimal('-0.82690620148098070841')),
 ('CS011615000061', 246, Decimal('-0.84601911220339877497')),
 ('CS029212000033', 3604, Decimal('0.38823385329429098451')),
 ('CS007515000119', 7157, Decimal('1.6941602340010485')),
 ('CS034515000123', 3699, Decimal('0.42315167096024706764')),
 ('CS004315000058', 490, Decimal('-0.75633545419820630882')),
 ('CS026414000014', 6671, Decimal('1.5155280299415258')),
 ('CS001615000099', 768, Decimal('-0.65415489302835587608'))]

---
> S-060: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を最小値0、最大値1に正規化して顧客ID、売上金額合計とともに表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [65]:
%%sql

WITH sales_amount AS(
    SELECT
        customer_id,
        SUM(amount) as sum_amount
    FROM
        receipt
    WHERE
        customer_id NOT LIKE 'Z%'
    GROUP BY
        customer_id
),
stats_amount AS (
    SELECT
        max(sum_amount) as max_amount,
        min(sum_amount) as min_amount
    FROM
        sales_amount
)
SELECT
    customer_id,
    sum_amount,
    (sum_amount - min_amount) * 1.0 
            / (max_amount -  min_amount) * 1.0 AS scale_amount
FROM sales_amount
CROSS JOIN stats_amount
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, Decimal('0.096976016684045881130')),
 ('CS004614000122', 248, Decimal('0.007733750434480361490')),
 ('CS003512000043', 298, Decimal('0.009906152241918665280')),
 ('CS011615000061', 246, Decimal('0.007646854362182829340')),
 ('CS029212000033', 3604, Decimal('0.153545359749739311780')),
 ('CS007515000119', 7157, Decimal('0.307916232186305179010')),
 ('CS034515000123', 3699, Decimal('0.157672923183872088980')),
 ('CS004315000058', 490, Decimal('0.018248175182481751820')),
 ('CS026414000014', 6671, Decimal('0.286800486618004866180')),
 ('CS001615000099', 768, Decimal('0.030326729231838720890'))]

---
> S-061: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を常用対数化（底=10）して顧客ID、売上金額合計とともに表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [66]:
%%sql

SELECT
    customer_id,
    SUM(amount),
    LOG(SUM(amount) + 1) as log_amount
FROM
    receipt
WHERE
    customer_id NOT LIKE 'Z%'
GROUP BY
    customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 3.362293937964231),
 ('CS004614000122', 248, 2.3961993470957363),
 ('CS003512000043', 298, 2.4756711883244296),
 ('CS011615000061', 246, 2.392696953259666),
 ('CS029212000033', 3604, 3.5569052690554477),
 ('CS007515000119', 7157, 3.8547916940539855),
 ('CS034515000123', 3699, 3.568201724066995),
 ('CS004315000058', 490, 2.6910814921229687),
 ('CS026414000014', 6671, 3.824256037629682),
 ('CS001615000099', 768, 2.885926339801431)]

---
> S-062: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を自然対数化(底=e）して顧客ID、売上金額合計とともに表示せよ（ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること）。結果は10件表示させれば良い。

In [67]:
%%sql

SELECT
    customer_id,
    SUM(amount),
    LN(SUM(amount) + 1) as log_amount
FROM
    receipt
WHERE
    customer_id NOT LIKE 'Z%'
GROUP BY
    customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 7.741967899820685),
 ('CS004614000122', 248, 5.517452896464707),
 ('CS003512000043', 298, 5.700443573390687),
 ('CS011615000061', 246, 5.5093883366279774),
 ('CS029212000033', 3604, 8.190077049719049),
 ('CS007515000119', 7157, 8.875985891325971),
 ('CS034515000123', 3699, 8.216088098632316),
 ('CS004315000058', 490, 6.19644412779452),
 ('CS026414000014', 6671, 8.805674944038582),
 ('CS001615000099', 768, 6.645090969505644)]

---
> S-063: 商品テーブル（product）の単価（unit_price）と原価（unit_cost）から、各商品の利益額を算出せよ。結果は10件表示させれば良い。

In [68]:
%%sql

SELECT
    product_cd, 
    unit_price, 
    unit_cost,
    unit_price - unit_cost as unit_profit
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, 149, 49),
 ('P040101002', 218, 164, 54),
 ('P040101003', 230, 173, 57),
 ('P040101004', 248, 186, 62),
 ('P040101005', 268, 201, 67),
 ('P040101006', 298, 224, 74),
 ('P040101007', 338, 254, 84),
 ('P040101008', 420, 315, 105),
 ('P040101009', 498, 374, 124),
 ('P040101010', 580, 435, 145)]

---
> S-064: 商品テーブル（product）の単価（unit_price）と原価（unit_cost）から、各商品の利益率の全体平均を算出せよ。 ただし、単価と原価にはNULLが存在することに注意せよ。

In [69]:
%%sql

SELECT
    AVG((unit_price * 1.0 - unit_cost) / unit_price) as unit_profit_rate
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(Decimal('0.24911389885177001279'),)]

---
> S-065: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。ただし、1円未満は切り捨てること。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [70]:
%%sql

SELECT
    product_cd, 
    unit_price, 
    unit_cost,
    TRUNC(unit_cost / 0.7) as new_price,
    ((TRUNC(unit_cost / 0.7) - unit_cost) 
             / TRUNC(unit_cost / 0.7)) as new_profit
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, 149, Decimal('212'), Decimal('0.29716981132075471698')),
 ('P040101002', 218, 164, Decimal('234'), Decimal('0.29914529914529914530')),
 ('P040101003', 230, 173, Decimal('247'), Decimal('0.29959514170040485830')),
 ('P040101004', 248, 186, Decimal('265'), Decimal('0.29811320754716981132')),
 ('P040101005', 268, 201, Decimal('287'), Decimal('0.29965156794425087108')),
 ('P040101006', 298, 224, Decimal('320'), Decimal('0.30000000000000000000')),
 ('P040101007', 338, 254, Decimal('362'), Decimal('0.29834254143646408840')),
 ('P040101008', 420, 315, Decimal('450'), Decimal('0.30000000000000000000')),
 ('P040101009', 498, 374, Decimal('534'), Decimal('0.29962546816479400749')),
 ('P040101010', 580, 435, Decimal('621'), Decimal('0.29951690821256038647'))]

---
> S-066: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。今回は、1円未満を四捨五入すること。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [71]:
%%sql

SELECT ROUND(2.5)

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(Decimal('3'),)]

In [72]:
%%sql

SELECT
    product_cd, 
    unit_price, 
    unit_cost,
    ROUND(unit_cost / 0.7) as new_price,
    ((ROUND(unit_cost / 0.7) - unit_cost) 
             / ROUND(unit_cost / 0.7)) as new_profit
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, 149, Decimal('213'), Decimal('0.30046948356807511737')),
 ('P040101002', 218, 164, Decimal('234'), Decimal('0.29914529914529914530')),
 ('P040101003', 230, 173, Decimal('247'), Decimal('0.29959514170040485830')),
 ('P040101004', 248, 186, Decimal('266'), Decimal('0.30075187969924812030')),
 ('P040101005', 268, 201, Decimal('287'), Decimal('0.29965156794425087108')),
 ('P040101006', 298, 224, Decimal('320'), Decimal('0.30000000000000000000')),
 ('P040101007', 338, 254, Decimal('363'), Decimal('0.30027548209366391185')),
 ('P040101008', 420, 315, Decimal('450'), Decimal('0.30000000000000000000')),
 ('P040101009', 498, 374, Decimal('534'), Decimal('0.29962546816479400749')),
 ('P040101010', 580, 435, Decimal('621'), Decimal('0.29951690821256038647'))]

---
> S-067: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。今回は、1円未満を切り上げること。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [73]:
%%sql

SELECT
    product_cd, 
    unit_price, 
    unit_cost,
    CEIL(unit_cost / 0.7) as new_price,
    ((CEIL(unit_cost / 0.7) - unit_cost) / CEIL(unit_cost / 0.7)) as new_profit
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, 149, Decimal('213'), Decimal('0.30046948356807511737')),
 ('P040101002', 218, 164, Decimal('235'), Decimal('0.30212765957446808511')),
 ('P040101003', 230, 173, Decimal('248'), Decimal('0.30241935483870967742')),
 ('P040101004', 248, 186, Decimal('266'), Decimal('0.30075187969924812030')),
 ('P040101005', 268, 201, Decimal('288'), Decimal('0.30208333333333333333')),
 ('P040101006', 298, 224, Decimal('320'), Decimal('0.30000000000000000000')),
 ('P040101007', 338, 254, Decimal('363'), Decimal('0.30027548209366391185')),
 ('P040101008', 420, 315, Decimal('450'), Decimal('0.30000000000000000000')),
 ('P040101009', 498, 374, Decimal('535'), Decimal('0.30093457943925233645')),
 ('P040101010', 580, 435, Decimal('622'), Decimal('0.30064308681672025723'))]

---
> S-068: 商品テーブル（product）の各商品について、消費税率10%の税込み金額を求めよ。 1円未満の端数は切り捨てとし、結果は10件表示すれば良い。ただし、単価（unit_price）にはNULLが存在することに注意せよ。

In [74]:
%%sql

SELECT
    product_cd,
    unit_price,
    TRUNC(unit_price * 1.1) as tax_price
FROM
    product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, Decimal('217')),
 ('P040101002', 218, Decimal('239')),
 ('P040101003', 230, Decimal('253')),
 ('P040101004', 248, Decimal('272')),
 ('P040101005', 268, Decimal('294')),
 ('P040101006', 298, Decimal('327')),
 ('P040101007', 338, Decimal('371')),
 ('P040101008', 420, Decimal('462')),
 ('P040101009', 498, Decimal('547')),
 ('P040101010', 580, Decimal('638'))]

---
> S-069: レシート明細テーブル（receipt）と商品テーブル（product）を結合し、顧客毎に全商品の売上金額合計と、カテゴリ大区分（category_major_cd）が"07"（瓶詰缶詰）の売上金額合計を計算の上、両者の比率を求めよ。抽出対象はカテゴリ大区分"07"（瓶詰缶詰）の購入実績がある顧客のみとし、結果は10件表示させればよい。

In [75]:
%%sql

WITH amount_all AS(
    SELECT
        customer_id,
        sum(amount) AS sum_all
    FROM
        receipt
    GROUP BY
        customer_id
),
amount_07 AS (
    SELECT
        r.customer_id,
        sum(r.amount) AS sum_07
    FROM
        receipt r
    JOIN
        product p
    ON
        r.product_cd = p.product_cd 
        and  p.category_major_cd = '07'
    GROUP BY
        customer_id
)
SELECT
    amount_all.customer_id,
    sum_all,
    sum_07,
    sum_07 * 1.0 / sum_all as sales_rate
FROM
    amount_all
JOIN
    amount_07
ON
    amount_all.customer_id = amount_07.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 102, Decimal('0.04430929626411815812')),
 ('CS011615000061', 246, 98, Decimal('0.39837398373983739837')),
 ('CS029212000033', 3604, 3604, Decimal('1.00000000000000000000')),
 ('CS007515000119', 7157, 2832, Decimal('0.39569652088864049183')),
 ('CS034515000123', 3699, 1202, Decimal('0.32495268991619356583')),
 ('CS026414000014', 6671, 3142, Decimal('0.47099385399490331285')),
 ('CS001615000099', 768, 318, Decimal('0.41406250000000000000')),
 ('CS010515000082', 1482, 553, Decimal('0.37314439946018893387')),
 ('CS019315000045', 813, 380, Decimal('0.46740467404674046740')),
 ('CS008513000099', 1322, 210, Decimal('0.15885022692889561271'))]

---
> S-070: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過日数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。

In [76]:
%%sql

WITH receit_distinct AS (
    SELECT distinct
        customer_id,
        sales_ymd
    FROM
        receipt
)
SELECT
    c.customer_id,
    r.sales_ymd,
    c.application_date,
    EXTRACT(DAY FROM (TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR), 'YYYYMMDD') 
                - TO_TIMESTAMP(c.application_date, 'YYYYMMDD'))) AS elapsed_days
FROM
    receit_distinct r
JOIN
    customer c
ON
    r.customer_id = c.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS017515000010', 20171117, '20150803', 837.0),
 ('CS019515000097', 20190630, '20141124', 1679.0),
 ('CS008515000005', 20170714, '20150216', 879.0),
 ('CS026414000097', 20170809, '20150430', 832.0),
 ('CS034514000008', 20181012, '20150807', 1162.0),
 ('CS029415000089', 20180409, '20150723', 991.0),
 ('CS019411000012', 20190314, '20141213', 1552.0),
 ('CS015614000006', 20190802, '20150211', 1633.0),
 ('CS007515000053', 20170712, '20150325', 840.0),
 ('CS024615000041', 20170729, '20150918', 680.0)]

---
> S-071: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過月数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。1ヶ月未満は切り捨てること。

In [77]:
%%sql

WITH receit_distinct AS (
    SELECT distinct
        customer_id,
        sales_ymd
    FROM
        receipt
),
time_age_tbl AS(
    SELECT
        c.customer_id,
        r.sales_ymd,
        c.application_date,
        AGE(TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR), 'YYYYMMDD'),
                    TO_TIMESTAMP(c.application_date, 'YYYYMMDD')) AS time_age
    FROM
        receit_distinct r
    JOIN
        customer c
    ON
        r.customer_id = c.customer_id
)
SELECT
    customer_id, 
    sales_ymd, application_date,
    extract(year from time_age) * 12 
        + extract(month from time_age) AS elapsed_months
FROM
    time_age_tbl
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS017515000010', 20171117, '20150803', 27.0),
 ('CS019515000097', 20190630, '20141124', 55.0),
 ('CS008515000005', 20170714, '20150216', 28.0),
 ('CS026414000097', 20170809, '20150430', 27.0),
 ('CS034514000008', 20181012, '20150807', 38.0),
 ('CS029415000089', 20180409, '20150723', 32.0),
 ('CS019411000012', 20190314, '20141213', 51.0),
 ('CS015614000006', 20190802, '20150211', 53.0),
 ('CS007515000053', 20170712, '20150325', 27.0),
 ('CS024615000041', 20170729, '20150918', 22.0)]

---
> S-072: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過年数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。1年未満は切り捨てること。

In [78]:
%%sql

WITH receit_distinct AS (
    SELECT distinct
        customer_id,
        sales_ymd
    FROM
        receipt
)
SELECT
    c.customer_id,
    r.sales_ymd,
    c.application_date,
    EXTRACT(YEAR FROM AGE(
        TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR), 'YYYYMMDD'), 
        TO_TIMESTAMP(c.application_date, 'YYYYMMDD'))) AS elapsed_years
FROM
    receit_distinct r
JOIN
    customer c
ON
    r.customer_id = c.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS017515000010', 20171117, '20150803', 2.0),
 ('CS019515000097', 20190630, '20141124', 4.0),
 ('CS008515000005', 20170714, '20150216', 2.0),
 ('CS026414000097', 20170809, '20150430', 2.0),
 ('CS034514000008', 20181012, '20150807', 3.0),
 ('CS029415000089', 20180409, '20150723', 2.0),
 ('CS019411000012', 20190314, '20141213', 4.0),
 ('CS015614000006', 20190802, '20150211', 4.0),
 ('CS007515000053', 20170712, '20150325', 2.0),
 ('CS024615000041', 20170729, '20150918', 1.0)]

---
> S-073: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からのエポック秒による経過時間を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。なお、時間情報は保有していないため各日付は0時0分0秒を表すものとする。

In [79]:
%%sql

WITH receit_distinct AS (
    SELECT distinct
        customer_id,
        sales_ymd
    FROM
        receipt
)
SELECT
    c.customer_id,
    r.sales_ymd,
    c.application_date,
    EXTRACT(
        EPOCH FROM TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR), 'YYYYMMDD')) 
            - EXTRACT(
                EPOCH FROM TO_TIMESTAMP(c.application_date, 'YYYYMMDD')
              ) AS elapsed_epoch
FROM
    receit_distinct r
JOIN
    customer c
ON
    r.customer_id = c.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS017515000010', 20171117, '20150803', 72316800.0),
 ('CS019515000097', 20190630, '20141124', 145065600.0),
 ('CS008515000005', 20170714, '20150216', 75945600.0),
 ('CS026414000097', 20170809, '20150430', 71884800.0),
 ('CS034514000008', 20181012, '20150807', 100396800.0),
 ('CS029415000089', 20180409, '20150723', 85622400.0),
 ('CS019411000012', 20190314, '20141213', 134092800.0),
 ('CS015614000006', 20190802, '20150211', 141091200.0),
 ('CS007515000053', 20170712, '20150325', 72576000.0),
 ('CS024615000041', 20170729, '20150918', 58752000.0)]

---
> S-074: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、当該週の月曜日からの経過日数を計算し、売上日、当該週の月曜日付とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値でデータを保持している点に注意）。

In [80]:
%%sql

SELECT
    customer_id,
    TO_DATE(CAST(sales_ymd AS VARCHAR), 'YYYYMMDD'),
    EXTRACT(DOW FROM (
        TO_DATE(CAST(sales_ymd AS VARCHAR), 'YYYYMMDD') - 1)) AS elapsed_years,
    TO_DATE(CAST(sales_ymd AS VARCHAR), 'YYYYMMDD')
        - CAST(EXTRACT(
            DOW FROM (TO_DATE(CAST(sales_ymd AS VARCHAR), 'YYYYMMDD') - 1)
          ) AS INTEGER) AS monday
FROM
    receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', datetime.date(2018, 11, 3), 5.0, datetime.date(2018, 10, 29)),
 ('CS008415000097', datetime.date(2018, 11, 18), 6.0, datetime.date(2018, 11, 12)),
 ('CS028414000014', datetime.date(2017, 7, 12), 2.0, datetime.date(2017, 7, 10)),
 ('ZZ000000000000', datetime.date(2019, 2, 5), 1.0, datetime.date(2019, 2, 4)),
 ('CS025415000050', datetime.date(2018, 8, 21), 1.0, datetime.date(2018, 8, 20)),
 ('CS003515000195', datetime.date(2019, 6, 5), 2.0, datetime.date(2019, 6, 3)),
 ('CS024514000042', datetime.date(2018, 12, 5), 2.0, datetime.date(2018, 12, 3)),
 ('CS040415000178', datetime.date(2019, 9, 22), 6.0, datetime.date(2019, 9, 16)),
 ('ZZ000000000000', datetime.date(2017, 5, 4), 3.0, datetime.date(2017, 5, 1)),
 ('CS027514000015', datetime.date(2019, 10, 10), 3.0, datetime.date(2019, 10, 7))]

---
> S-075: 顧客テーブル（customer）からランダムに1%のデータを抽出し、先頭から10件データを抽出せよ。

In [81]:
%%sql

-- コード例１（シンプルにやるなら）
SELECT * FROM customer WHERE RANDOM() <= 0.01
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS029513000035', '長澤 千佳子', '1', '女性', datetime.date(1961, 9, 30), 57, '134-0084', '東京都江戸川区東葛西**********', 'S12029', '20151001', 'C-20100725-C'),
 ('CS038513000076', 'ともさか まみ', '1', '女性', datetime.date(1962, 10, 18), 56, '134-0084', '東京都江戸川区東葛西**********', 'S13038', '20151228', '4-20090608-6'),
 ('CS027412000206', '浦野 りえ', '1', '女性', datetime.date(1973, 12, 1), 45, '251-0000', '神奈川県藤沢市**********', 'S14027', '20180621', '0-00000000-0'),
 ('CS006513000209', '金城 遥', '1', '女性', datetime.date(1965, 6, 11), 53, '224-0057', '神奈川県横浜市都筑区川和町**********', 'S14006', '20151108', '0-00000000-0'),
 ('CS011512000070', '野上 恵子', '1', '女性', datetime.date(1961, 9, 1), 57, '211-0037', '神奈川県川崎市中原区井田三舞町**********', 'S14011', '20150404', '0-00000000-0'),
 ('CS027502000050', '飯島 仁', '0', '男性', datetime.date(1960, 1, 19), 59, '251-0051', '神奈川県藤沢市白旗**********', 'S14027', '20160119', '0-00000000-0'),
 ('CS021615000009', '五十嵐 あさみ', '1', '女性', datetime.date(1953, 6, 14), 65, '259-1142', '神奈川県伊勢原市田中**********', 'S14021', '20150316', '6-20101025-9'),
 ('CS022415000086', '関 雅彦', '9', '不明', datetime.date(1976, 2, 20), 43, '249-0001', '神奈川県逗子市久木**********', 'S14022', '20151128', '5-20100514-3'),
 ('CS033413000050', '山上 希', '1', '女性', datetime.date(1977, 1, 6), 42, '246-0021', '神奈川県横浜市瀬谷区二ツ橋町**********', 'S14033', '20150627', '3-20080519-5'),
 ('CS004313000147', '杉野 恵梨香', '1', '女性', datetime.date(1987, 5, 15), 31, '176-0023', '東京都練馬区中村北**********', 'S13004', '20150427', '0-00000000-0')]

In [82]:
%%sql

-- コード例２（丁寧にやるなら）
WITH customer_tmp AS(
    SELECT
        *
        ,ROW_NUMBER() OVER() as row
        ,COUNT(*) OVER() as count
    FROM customer
    ORDER BY random()
)
SELECT 
    customer_id
    ,customer_name
    ,gender_cd
    ,gender
    ,birth_day
    ,age
    ,postal_cd
    ,address
    ,application_store_cd
    ,application_date
    ,status_cd
FROM customer_tmp
WHERE row < count * 0.01
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS005613000163', '杉本 麻由子', '1', '女性', datetime.date(1950, 11, 12), 68, '176-0021', '東京都練馬区貫井**********', 'S13005', '20170821', '0-00000000-0'),
 ('CS015414000103', '奥野 陽子', '1', '女性', datetime.date(1977, 8, 9), 41, '136-0073', '東京都江東区北砂**********', 'S13015', '20150722', 'B-20100609-B'),
 ('CS026513000147', '早美 愛子', '1', '女性', datetime.date(1959, 6, 4), 59, '251-0046', '神奈川県藤沢市辻堂西海岸**********', 'S14026', '20150222', '5-20100307-6'),
 ('CS004413000678', '杉原 まひる', '1', '女性', datetime.date(1978, 1, 6), 41, '165-0032', '東京都中野区鷺宮**********', 'S13004', '20161223', '0-00000000-0'),
 ('CS020401000016', '宮下 達士', '0', '男性', datetime.date(1974, 9, 15), 44, '174-0065', '東京都板橋区若木**********', 'S13020', '20150225', '0-00000000-0'),
 ('CS005513000399', '仲村 涼', '1', '女性', datetime.date(1963, 9, 3), 55, '165-0031', '東京都中野区上鷺宮**********', 'S13005', '20170612', '0-00000000-0'),
 ('CS026512000160', '西井 美咲', '1', '女性', datetime.date(1967, 12, 6), 51, '253-0001', '神奈川県茅ヶ崎市赤羽根**********', 'S14026', '20160326', '0-00000000-0'),
 ('CS031515000093', '中村 ひろ子', '1', '女性', datetime.date(1964, 6, 25), 54, '151-0053', '東京都渋谷区代々木**********', 'S13031', '20150204', 'D-20100304-D'),
 ('CS010415000034', '本山 菜々美', '1', '女性', datetime.date(1973, 11, 9), 45, '222-0026', '神奈川県横浜市港北区篠原町**********', 'S14010', '20150928', 'E-20100922-E'),
 ('CS001403000079', '綾小路 洋介', '0', '男性', datetime.date(1972, 5, 17), 46, '144-0053', '東京都大田区蒲田本町**********', 'S13001', '20160112', '0-00000000-0')]

---
> S-076:  顧客テーブル（customer）から性別（gender_cd）の割合に基づきランダムに10%のデータを層化抽出し、性別ごとに件数を集計せよ。

In [83]:
%%sql

-- カテゴリ数が少ない場合はそれぞれサンプリングしUNIONするほうが簡単だが、カテゴリ数が多いケースを考慮して以下のSQLとした
-- RANDOMでORDER BYしているため、大量データを扱う場合は注意が必要
WITH cusotmer_random AS (
    SELECT customer_id, g_cd, cnt
    FROM (
        SELECT
            ARRAY_AGG(customer ORDER BY RANDOM()) AS customer_r, 
            gender_cd as g_cd, count(1) as cnt
        FROM
            customer
        GROUP BY gender_cd
    )sample, UNNEST(customer_r)
),
cusotmer_rownum AS(
    SELECT * , ROW_NUMBER() OVER(PARTITION BY g_cd) AS rn FROM cusotmer_random
)
SELECT
    g_cd, 
    count(1)
FROM
    cusotmer_rownum
WHERE rn <= cnt * 0.1
GROUP BY g_cd

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('0', 298), ('1', 1791), ('9', 107)]

---
> S-077: レシート明細テーブル（receipt）の売上金額（amount）を顧客単位に合計し、合計した売上金額の外れ値を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、ここでは外れ値を平均から3σ以上離れたものとする。結果は10件表示させれば良い。

In [84]:
%%sql

WITH sales_amount AS(
SELECT customer_id, SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
)
SELECT customer_id, sum_amount
FROM sales_amount
CROSS JOIN (
    SELECT AVG(sum_amount) AS avg_amount, STDDEV_SAMP(sum_amount) AS std_amount
    FROM sales_amount   
) stats_amount
WHERE ABS(sum_amount - avg_amount) / std_amount > 3
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021514000008', 12839),
 ('CS022515000065', 12903),
 ('CS007514000094', 15735),
 ('CS015515000034', 15300),
 ('CS026414000039', 12944),
 ('CS018414000065', 12313),
 ('CS011415000006', 16094),
 ('CS011414000012', 11432),
 ('CS021515000172', 13974),
 ('CS031414000028', 11743)]

---
> S-078: レシート明細テーブル（receipt）の売上金額（amount）を顧客単位に合計し、合計した売上金額の外れ値を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、ここでは外れ値を第一四分位と第三四分位の差であるIQRを用いて、「第一四分位数-1.5×IQR」よりも下回るもの、または「第三四分位数+1.5×IQR」を超えるものとする。結果は10件表示させれば良い。

In [85]:
%%sql

WITH sales_amount AS(
SELECT customer_id, SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
)
SELECT customer_id, sum_amount
FROM sales_amount
CROSS JOIN (
    SELECT
        PERCENTILE_CONT(0.25) WITHIN GROUP(ORDER BY sum_amount) as amount_25per,
        PERCENTILE_CONT(0.75) WITHIN GROUP(ORDER BY sum_amount) as amount_75per
    FROM sales_amount   
) stats_amount
WHERE sum_amount < amount_25per - (amount_75per - amount_25per) * 1.5 
    OR amount_75per + (amount_75per - amount_25per) * 1.5 < sum_amount
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS013415000226', 8362),
 ('CS011415000041', 9454),
 ('CS014514000004', 8872),
 ('CS021514000008', 12839),
 ('CS014515000007', 9763),
 ('CS040415000220', 10158),
 ('CS028415000161', 8465),
 ('CS034515000173', 10074),
 ('CS022515000065', 12903),
 ('CS007514000094', 15735)]

---
> S-079: 商品テーブル（product）の各項目に対し、欠損数を確認せよ。

In [86]:
%%sql

SELECT 
    SUM(
        CASE WHEN product_cd IS NULL THEN 1 ELSE 0 END
    ) AS product_cd,
    SUM(
        CASE WHEN category_major_cd IS NULL THEN 1 ELSE 0 END
    ) AS category_major_cd,
    SUM(
        CASE WHEN category_medium_cd IS NULL THEN 1 ELSE 0 END
    ) AS category_medium_cd,
    SUM(
        CASE WHEN category_small_cd IS NULL THEN 1 ELSE 0 END
    ) AS category_small_cd,
    SUM(
        CASE WHEN unit_price IS NULL THEN 1 ELSE 0 END
    ) AS unit_price,
    SUM(
        CASE WHEN unit_cost IS NULL THEN 1 ELSE 0 END
    ) AS unit_cost
FROM product LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(0, 0, 0, 0, 7, 7)]

---
> S-080: 商品テーブル（product）のいずれかの項目に欠損が発生しているレコードを全て削除した新たなproduct_1を作成せよ。なお、削除前後の件数を表示させ、前設問で確認した件数だけ減少していることも確認すること。

In [87]:
%%sql

SELECT COUNT(1) FROM product;

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(10030,)]

In [88]:
%%sql

DROP TABLE IF EXISTS product_1;
CREATE TABLE product_1 AS (
    SELECT * FROM product
    WHERE unit_price IS NOT NULL OR  unit_cost IS NOT NULL
);
SELECT COUNT(1) FROM product_1;

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
10023 rows affected.
1 rows affected.

[(10023,)]

---
> S-081: 単価（unit_price）と原価（unit_cost）の欠損値について、それぞれの平均値で補完した新たなproduct_2を作成せよ。なお、平均値について1円未満は四捨五入とする。補完実施後、各項目について欠損が生じていないことも確認すること。

In [89]:
%%sql

DROP TABLE IF EXISTS product_2;
CREATE TABLE product_2 AS (
    SELECT
        product_cd, 
        category_major_cd, 
        category_medium_cd, 
        category_small_cd, 
        COALESCE(unit_price, unit_avg) as unit_price,
        COALESCE(unit_cost, cost_avg) as unit_cost
    FROM
        product
    CROSS JOIN (
        SELECT
            ROUND(AVG(unit_price)) AS unit_avg,
            ROUND(AVG(unit_cost)) AS cost_avg
        FROM
            product
    ) stats_product
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
10030 rows affected.

[]

In [90]:
%%sql

SELECT 
    SUM(CASE WHEN unit_price IS NULL THEN 1 ELSE 0 END) AS unit_price,
    SUM(CASE WHEN unit_cost IS NULL THEN 1 ELSE 0 END) AS unit_cost
FROM product_2 LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(0, 0)]

---
> S-082:  単価（unit_price）と原価（unit_cost）の欠損値について、それぞれの中央値で補完した新たなproduct_3を作成せよ。なお、中央値について1円未満は四捨五入とする。補完実施後、各項目について欠損が生じていないことも確認すること。

In [91]:
%%sql

DROP TABLE IF EXISTS product_3;
CREATE TABLE product_3 AS (
    SELECT
        product_cd, 
        category_major_cd, 
        category_medium_cd, 
        category_small_cd, 
        COALESCE(unit_price, unit_med) as unit_price,
        COALESCE(unit_cost, cost_med) as unit_cost
    FROM
        product
    CROSS JOIN (
        SELECT
            ROUND(
                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY unit_price)
            ) AS unit_med,
            ROUND(
                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY unit_cost)
            ) AS cost_med
        FROM
            product
    ) stats_product
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
10030 rows affected.

[]

In [92]:
%%sql

SELECT 
    SUM(CASE WHEN unit_price IS NULL THEN 1 ELSE 0 END) AS unit_price,
    SUM(CASE WHEN unit_cost IS NULL THEN 1 ELSE 0 END) AS unit_cost
FROM product_3 LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(0, 0)]

---
> S-083: 単価（unit_price）と原価（unit_cost）の欠損値について、各商品の小区分（category_small_cd）ごとに算出した中央値で補完した新たなproduct_4を作成せよ。なお、中央値について1円未満は四捨五入とする。補完実施後、各項目について欠損が生じていないことも確認すること。

In [93]:
%%sql

DROP TABLE IF EXISTS product_4;
CREATE TABLE product_4 AS (
    WITH category_median AS(
        SELECT
            category_small_cd, 
            ROUND(
                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY unit_price)
            ) AS unit_med,
            ROUND(
                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY unit_cost)
            ) AS cost_med
        FROM product
        GROUP BY category_small_cd
    )
    SELECT
        product_cd, 
        category_major_cd, 
        category_medium_cd, 
        category_small_cd, 
        COALESCE(unit_price, unit_med) as unit_price,
        COALESCE(unit_cost, cost_med) as unit_cost
    FROM
        product
    JOIN
        category_median
    USING(category_small_cd)
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
10030 rows affected.

[]

In [94]:
%%sql

SELECT 
    SUM(CASE WHEN unit_price IS NULL THEN 1 ELSE 0 END) AS unit_price,
    SUM(CASE WHEN unit_cost IS NULL THEN 1 ELSE 0 END) AS unit_cost
FROM product_4 LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(0, 0)]

---
> S-084: 顧客テーブル（customer）の全顧客に対し、全期間の売上金額に占める2019年売上金額の割合を計算せよ。ただし、販売実績のない場合は0として扱うこと。そして計算した割合が0超のものを抽出せよ。 結果は10件表示させれば良い。

In [95]:
%%sql

WITH sales_amount_2019 AS (
    SELECT
        customer_id,
        SUM(amount) AS sum_amount_2019
    FROM
        receipt
    WHERE
        20190101 <= sales_ymd AND sales_ymd <= 20191231
    GROUP BY
        customer_id
),
sales_amount_all AS (
    SELECT
        customer_id,
        SUM(amount) AS sum_amount_all
    FROM
        receipt
    GROUP BY
        customer_id
)
SELECT
    a.customer_id,
    COALESCE(b.sum_amount_2019, 0) AS sales_amount_2019,
    COALESCE(c.sum_amount_all, 0)  AS sales_amount_all,
    CASE COALESCE(c.sum_amount_all, 0)
        WHEN 0 THEN 0 
        ELSE COALESCE(b.sum_amount_2019, 0) * 1.0 / c.sum_amount_all
    END AS sales_rate
FROM
    customer a
LEFT JOIN
    sales_amount_2019 b
ON a.customer_id = b.customer_id
LEFT JOIN
    sales_amount_all c
ON a.customer_id = c.customer_id
WHERE CASE COALESCE(c.sum_amount_all, 0) 
        WHEN 0 THEN 0 
        ELSE COALESCE(b.sum_amount_2019, 0) * 1.0 / c.sum_amount_all 
        END > 0
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS031415000172', 2971, 5088, Decimal('0.58392295597484276730')),
 ('CS015414000103', 874, 3122, Decimal('0.27994875080076873799')),
 ('CS011215000048', 248, 3444, Decimal('0.07200929152148664344')),
 ('CS029415000023', 3767, 5167, Decimal('0.72904973872653377201')),
 ('CS035415000029', 5823, 7504, Decimal('0.77598614072494669510')),
 ('CS023513000066', 208, 771, Decimal('0.26977950713359273671')),
 ('CS035513000134', 463, 1565, Decimal('0.29584664536741214058')),
 ('CS001515000263', 216, 216, Decimal('1.00000000000000000000')),
 ('CS006415000279', 229, 229, Decimal('1.00000000000000000000')),
 ('CS031415000106', 215, 7741, Decimal('0.02777418938121689704'))]

---
> S-085: 顧客テーブル（customer）の全顧客に対し、郵便番号（postal_cd）を用いて経度緯度変換用テーブル（geocode）を紐付け、新たなcustomer_1を作成せよ。ただし、複数紐づく場合は経度（longitude）、緯度（latitude）それぞれ平均を算出すること。

In [96]:
%%sql

DROP TABLE IF EXISTS customer_1;

CREATE TABLE customer_1 AS (
    WITH geocode_avg AS(
        SELECT
            postal_cd,
            AVG(longitude) as m_longitude,
            AVG(latitude) as m_latitude
        FROM
            geocode
        GROUP BY 
            postal_cd
    )
    SELECT 
        *
    FROM
        customer c
    JOIN
        geocode_avg g
    USING(postal_cd)
);

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
21971 rows affected.

[]

In [97]:
%%sql

SELECT * FROM customer_1 LIMIT 3

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('136-0076', 'CS037613000071', '六角 雅彦', '9', '不明', datetime.date(1952, 4, 1), 66, '東京都江東区南砂**********', 'S13037', '20150414', '0-00000000-0', Decimal('139.8350200000000000'), Decimal('35.6719300000000000')),
 ('151-0053', 'CS031415000172', '宇多田 貴美子', '1', '女性', datetime.date(1976, 10, 4), 42, '東京都渋谷区代々木**********', 'S13031', '20150529', 'D-20100325-C', Decimal('139.6896500000000000'), Decimal('35.6737400000000000')),
 ('245-0016', 'CS028811000001', '堀井 かおり', '1', '女性', datetime.date(1933, 3, 27), 86, '神奈川県横浜市泉区和泉町**********', 'S14028', '20160115', '0-00000000-0', Decimal('139.4836000000000000'), Decimal('35.3912500000000000'))]

---
> S-086: 前設問で作成した緯度経度つき顧客テーブル（customer_1）に対し、申込み店舗コード（application_store_cd）をキーに店舗テーブル（store）と結合せよ。そして申込み店舗の緯度（latitude）・経度情報（longitude)と顧客の緯度・経度を用いて距離（km）を求め、顧客ID（customer_id）、顧客住所（address）、店舗住所（address）とともに表示せよ。計算式は簡易式で良いものとするが、その他精度の高い方式を利用したライブラリを利用してもかまわない。結果は10件表示すれば良い。

$$
緯度（ラジアン）：\phi \\
経度（ラジアン）：\lambda \\
距離L = 6371 * arccos(sin \phi_1 * sin \phi_2
+ cos \phi_1 * cos \phi_2 * cos(\lambda_1 − \lambda_2))
$$

In [98]:
%%sql

SELECT
    c.customer_id,
    c.address AS customer_address,
    s.address AS store_address,
    (
        6371 * ACOS( 
                SIN(RADIANS(c.m_latitude)) 
                * SIN(RADIANS(s.latitude))
                + COS(RADIANS(c.m_latitude)) 
                * COS(RADIANS(s.latitude)) 
                * COS(RADIANS(c.m_longitude) - RADIANS(s.longitude))
        )
    ) AS distance 
FROM
    customer_1 c
JOIN
    store s
ON
    c.application_store_cd = s.store_cd
limit 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS037613000071', '東京都江東区南砂**********', '東京都江東区南砂一丁目', 1.4511822099658445),
 ('CS031415000172', '東京都渋谷区代々木**********', '東京都渋谷区初台二丁目', 0.4117334789298223),
 ('CS028811000001', '神奈川県横浜市泉区和泉町**********', '神奈川県横浜市瀬谷区二ツ橋町', 8.065196026704987),
 ('CS001215000145', '東京都大田区仲六郷**********', '東京都大田区仲六郷二丁目', 1.2684209720729687),
 ('CS015414000103', '東京都江東区北砂**********', '東京都江東区南砂二丁目', 1.449673414532165),
 ('CS015804000004', '東京都江東区北砂**********', '東京都江東区南砂二丁目', 1.449673414532165),
 ('CS007403000016', '千葉県八千代市上高野**********', '千葉県佐倉市上志津', 1.9208032538419055),
 ('CS035614000014', '東京都世田谷区桜新町**********', '東京都世田谷区用賀四丁目', 1.0214681484997588),
 ('CS011215000048', '神奈川県横浜市港北区日吉本町**********', '神奈川県横浜市港北区日吉本町四丁目', 0.8182767808775093),
 ('CS040412000191', '神奈川県横浜市緑区北八朔町**********', '神奈川県横浜市緑区長津田みなみ台五丁目', 3.6641233580823287)]

---
> S-087: 顧客テーブル（customer）では、異なる店舗での申込みなどにより同一顧客が複数登録されている。名前（customer_name）と郵便番号（postal_cd）が同じ顧客は同一顧客とみなし、1顧客1レコードとなるように名寄せした名寄顧客テーブル（customer_u）を作成せよ。ただし、同一顧客に対しては売上金額合計が最も高いものを残すものとし、売上金額合計が同一もしくは売上実績の無い顧客については顧客ID（customer_id）の番号が小さいものを残すこととする。

In [99]:
%%sql

DROP TABLE IF EXISTS customer_u;
CREATE TABLE customer_u AS (
    WITH sales_amount AS(
    SELECT
        c.customer_id,
        c.customer_name,
        c.postal_cd, 
        SUM(r.amount) as sum_amount
    FROM
        customer c

    LEFT JOIN
        receipt r        
    ON c.customer_id = r.customer_id
    GROUP by
        c.customer_id, c.customer_name, c.postal_cd
    ),
    sales_ranking AS(
    SELECT
        *,
        ROW_NUMBER() OVER(
            PARTITION BY customer_name, postal_cd 
            ORDER BY sum_amount desc, customer_ID ) as rank
    FROM sales_amount
    )
    SELECT c.*
    FROM
        customer c
    JOIN
        sales_ranking r
    ON
        c.customer_id = r.customer_id
        and r.rank = 1
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
21941 rows affected.

[]

In [100]:
%%sql

SELECT 
    cnt, 
    cnt_u, 
    cnt - cnt_u AS diff 
FROM
    (SELECT count(1) as cnt FROM customer) customer
CROSS JOIN (SELECT count(1) as cnt_u FROM customer_u) customer_u

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(21971, 21941, 30)]

---
> S-088: 前設問で作成したデータを元に、顧客テーブルに統合名寄IDを付与したテーブル（customer_n）を作成せよ。ただし、統合名寄IDは以下の仕様で付与するものとする。
>
>- 重複していない顧客：顧客ID（customer_id）を設定
>- 重複している顧客：前設問で抽出したレコードの顧客IDを設定

In [101]:
%%sql

DROP TABLE IF EXISTS customer_n;
CREATE TABLE customer_n AS (
    SELECT 
        c.*, 
        u.customer_id as integration_id
    FROM 
        customer c
    JOIN
        customer_u u
    ON c.customer_name = u.customer_name
        and c.postal_cd = u.postal_cd
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
21971 rows affected.

[]

In [102]:
%%sql
SELECT count(1) FROM customer_n
WHERE customer_id != integration_id

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(30,)]

---
> S-089: 売上実績のある顧客に対し、予測モデル構築のため学習用データとテスト用データに分割したい。それぞれ8:2の割合でランダムにデータを分割せよ。

In [103]:
%%sql

SELECT SETSEED(0.1);

CREATE TEMP TABLE IF NOT EXISTS sales_record_customer_id AS (
    SELECT customer_id ,ROW_NUMBER()OVER(ORDER BY RANDOM()) AS row
    FROM customer
    LEFT JOIN receipt USING(customer_id)
    GROUP BY customer_id
    HAVING SUM(amount) IS NOT NULL 
);

DROP TABLE IF EXISTS customer_train;
CREATE TABLE customer_train AS
SELECT customer.*
FROM sales_record_customer_id
LEFT JOIN customer USING(customer_id)
WHERE sales_record_customer_id.row < (SELECT 
                                          COUNT(0) 
                                      FROM sales_record_customer_id) *0.8
;

DROP TABLE IF EXISTS customer_test;

CREATE TABLE customer_test AS
    SELECT customer.* 
    FROM sales_record_customer_id 
    LEFT JOIN customer USING(customer_id)
    EXCEPT
    SELECT * from customer_train
;

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.
8306 rows affected.
Done.
6644 rows affected.
Done.
1662 rows affected.

[]

---
> S-090: レシート明細テーブル（receipt）は2017年1月1日〜2019年10月31日までのデータを有している。売上金額（amount）を月次で集計し、学習用に12ヶ月、テスト用に6ヶ月のモデル構築用データを3テーブルとしてセット作成せよ。データの持ち方は自由とする。

In [104]:
%%sql

-- SQL向きではないため、やや強引に記載する（分割数が多くなる場合はSQLが長くなるため現実的ではない）
-- また、秒単位のデータなど時系列が細かく、かつ長期間に渡る場合はデータが膨大となるため注意（そのようなケースではループ処理でモデル学習ができる言語が望ましい）
-- 学習データ(0)とテストデータ(1)を区別するフラグを付与する
DROP TABLE IF EXISTS sales_amount ;

CREATE TABLE sales_amount AS (
    SELECT 
        SUBSTR(CAST(sales_ymd AS VARCHAR), 1, 6) AS sales_ym, 
        SUM(amount) AS sum_amount,
        row_number() OVER(PARTITION BY NULL ORDER BY 
                         SUBSTR(CAST(sales_ymd AS VARCHAR), 1, 6)) AS rn
    FROM
        receipt
    GROUP BY sales_ym
);

-- SQLでは限界があるが、作成データセットの増加に伴いなるべく使いまわしができるものにする
-- WITH句内のLAG関数について、ラグ期間を変えれば使い回せるよう記述
DROP TABLE IF EXISTS series_data_1 ;
CREATE TABLE series_data_1 AS (
    WITH lag_amount AS (
        SELECT sales_ym, sum_amount, LAG(rn, 0) OVER (ORDER BY rn) AS rn
        FROM sales_amount
    )
    SELECT 
        sales_ym, sum_amount, 
        CASE WHEN rn <= 12 THEN 0 WHEN 12 < rn THEN 1 END as test_flg
    FROM lag_amount 
    WHERE rn <= 18);

DROP TABLE IF EXISTS series_data_2 ;

CREATE TABLE series_data_2 AS (
    WITH lag_amount AS (
        SELECT 
            sales_ym, 
            sum_amount, 
            LAG(rn, 6) OVER (ORDER BY rn) AS rn
        FROM sales_amount
    )
    SELECT
        sales_ym, 
        sum_amount, 
        CASE WHEN rn <= 12 THEN 0 WHEN 12 < rn THEN 1 END as test_flg
    FROM lag_amount WHERE rn <= 18);

DROP TABLE IF EXISTS series_data_3 ;

CREATE TABLE series_data_3 AS (
    WITH lag_amount AS (
        SELECT sales_ym, sum_amount, LAG(rn, 12) OVER (ORDER BY rn) AS rn
        FROM sales_amount
    )
    SELECT 
        sales_ym, 
        sum_amount, 
        CASE WHEN rn <= 12 THEN 0 WHEN 12 < rn THEN 1 END as test_flg
    FROM lag_amount WHERE rn <= 18);

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
34 rows affected.
Done.
18 rows affected.
Done.
18 rows affected.
Done.
18 rows affected.

[]

In [105]:
%%sql

SELECT * FROM series_data_1

 * postgresql://padawan:***@db:5432/dsdojo_db
18 rows affected.

[('201701', 902056, 0),
 ('201702', 764413, 0),
 ('201703', 962945, 0),
 ('201704', 847566, 0),
 ('201705', 884010, 0),
 ('201706', 894242, 0),
 ('201707', 959205, 0),
 ('201708', 954836, 0),
 ('201709', 902037, 0),
 ('201710', 905739, 0),
 ('201711', 932157, 0),
 ('201712', 939654, 0),
 ('201801', 944509, 1),
 ('201802', 864128, 1),
 ('201803', 946588, 1),
 ('201804', 937099, 1),
 ('201805', 1004438, 1),
 ('201806', 1012329, 1)]

---
> S-091: 顧客テーブル（customer）の各顧客に対し、売上実績のある顧客数と売上実績のない顧客数が1:1となるようにアンダーサンプリングで抽出せよ。

In [106]:
%%sql

SELECT SETSEED(0.1);

WITH pre_table_1 AS(
    SELECT
        c.*
        ,COALESCE(r.amount,0) AS r_amount
    FROM
        customer c
    LEFT JOIN
        receipt r
    ON
        c.customer_id=r.customer_id
)
,pre_table_2 AS(
    SELECT
        customer_id
        ,CASE WHEN SUM(r_amount)>0 THEN 1 ELSE 0 END  AS is_buy_flag
        ,CASE WHEN SUM(r_amount)=0 THEN 1 ELSE 0 END  AS is_not_buy_flag
    FROM
        pre_table_1
    GROUP BY
        customer_id
)
,pre_table_3 AS(
    SELECT
        *
        ,ROW_NUMBER() OVER(PARTITION BY is_buy_flag ORDER BY RANDOM())
    FROM
        pre_table_2
    CROSS JOIN
        (SELECT SUM(is_buy_flag) AS buying FROM pre_table_2) AS t1
    CROSS JOIN
        (SELECT SUM(is_not_buy_flag) AS not_buying FROM pre_table_2) AS t2
)
,pre_table_4 AS(
    SELECT
        *
    FROM
        pre_table_3
    WHERE
        row_number<=buying
        AND
        row_number<=not_buying
)

SELECT COUNT(*) FROM pre_table_4 GROUP BY is_buy_flag;

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.
2 rows affected.

[(8306,), (8306,)]

---
> S-092: 顧客テーブル（customer）では、性別に関する情報が非正規化の状態で保持されている。これを第三正規化せよ。

In [107]:
%%sql

DROP TABLE IF EXISTS customer_std;
CREATE TABLE customer_std AS (
    SELECT
        customer_id,
        customer_name,
        gender_cd,
        birth_day,
        age,
        postal_cd,
        application_store_cd,
        application_date,
        status_cd
    FROM
        customer
);

DROP TABLE IF EXISTS gender_std;
CREATE TABLE gender_std AS (
    SELECT distinct
        gender_cd, gender
    FROM
        customer
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
21971 rows affected.
Done.
3 rows affected.

[]

In [108]:
%%sql

SELECT * FROM gender_std

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('0', '男性'), ('9', '不明'), ('1', '女性')]

---
> S-093: 商品テーブル（product）では各カテゴリのコード値だけを保有し、カテゴリ名は保有していない。カテゴリテーブル（category）と組み合わせて非正規化し、カテゴリ名を保有した新たな商品テーブルを作成せよ。

In [109]:
%%sql

DROP TABLE IF EXISTS product_full;
CREATE TABLE product_full AS (
    SELECT
        p.product_cd,
        p.category_major_cd,
        c.category_major_name,
        p.category_medium_cd,
        c.category_medium_name,
        p.category_small_cd,
        c.category_small_name,
        p.unit_price,
        p.unit_cost
    FROM
        product p
    JOIN
        category c
    USING(category_small_cd)
)

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
10030 rows affected.

[]

In [110]:
%%sql

SELECT * FROM product_full LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 198, 149),
 ('P040101002', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 218, 164),
 ('P040101003', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 230, 173),
 ('P040101004', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 248, 186),
 ('P040101005', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 268, 201),
 ('P040101006', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 298, 224),
 ('P040101007', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 338, 254),
 ('P040101008', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 420, 315),
 ('P040101009', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 498, 374),
 ('P040101010', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 580, 435)]

---
> S-094: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは'/tmp/data'を指定することでJupyterの/'work/data'と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [111]:
%%sql

COPY product_full TO '/tmp/data/S_product_full_UTF-8_header.csv' 
WITH CSV HEADER encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

---
> S-095: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは'/tmp/data'を指定することでJupyterの/'work/data'と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはSJIS

In [112]:
%%sql

COPY product_full TO '/tmp/data/S_product_full_SJIS_header.csv' 
WITH CSV HEADER encoding 'SJIS'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

---
> S-096: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは'/tmp/data'を指定することでJupyterの/'work/data'と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ無し
> - 文字コードはUTF-8

In [113]:
%%sql

COPY product_full TO '/tmp/data/S_product_full_UTF-8_noh.csv' 
WITH CSV encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

---
> S-097: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭3件を表示させ、正しくとりまれていることを確認せよ。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [114]:
%%sql

DROP TABLE IF EXISTS product_full;
CREATE TABLE product_full (
        product_cd           VARCHAR(10),
        category_major_cd    VARCHAR(2),
        category_major_name  VARCHAR(20),
        category_medium_cd   VARCHAR(4),
        category_medium_name VARCHAR(20),
        category_small_cd    VARCHAR(6),
        category_small_name  VARCHAR(20),
        unit_price           INTEGER,
        unit_cost            INTEGER
);

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
Done.

[]

In [115]:
%%sql

COPY product_full FROM '/tmp/data/S_product_full_UTF-8_header.csv' 
WITH CSV HEADER encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

In [116]:
%%sql

SELECT * FROM product_full LIMIT 3

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('P040101001', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 198, 149),
 ('P040101002', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 218, 164),
 ('P040101003', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 230, 173)]

---
> S-098: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭3件を表示させ、正しくとりまれていることを確認せよ。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ無し
> - 文字コードはUTF-8

In [117]:
%%sql

DROP TABLE IF EXISTS product_full;
CREATE TABLE product_full (
        product_cd           VARCHAR(10),
        category_major_cd    VARCHAR(2),
        category_major_name  VARCHAR(20),
        category_medium_cd   VARCHAR(4),
        category_medium_name VARCHAR(20),
        category_small_cd    VARCHAR(6),
        category_small_name  VARCHAR(20),
        unit_price           INTEGER,
        unit_cost            INTEGER
);

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
Done.

[]

In [118]:
%%sql

COPY product_full FROM '/tmp/data/S_product_full_UTF-8_noh.csv' 
WITH CSV encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

In [119]:
%%sql

SELECT * FROM product_full LIMIT 3

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('P040101001', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 198, 149),
 ('P040101002', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 218, 164),
 ('P040101003', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 230, 173)]

---
> S-099: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは'/tmp/data'を指定することでJupyterの/'work/data'と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はTSV（タブ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [120]:
%%sql

COPY product_full TO '/tmp/data/S_product_full_UTF-8_header.tsv' 
WITH CSV HEADER DELIMITER E'\t' encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

---
> S-100: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭10件を表示させ、正しくとりまれていることを確認せよ。
>
> - ファイル形式はTSV（タブ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [121]:
%%sql

DROP TABLE IF EXISTS product_full;
CREATE TABLE product_full (
        product_cd           VARCHAR(10),
        category_major_cd    VARCHAR(2),
        category_major_name  VARCHAR(20),
        category_medium_cd   VARCHAR(4),
        category_medium_name VARCHAR(20),
        category_small_cd    VARCHAR(6),
        category_small_name  VARCHAR(20),
        unit_price           INTEGER,
        unit_cost            INTEGER
);

 * postgresql://padawan:***@db:5432/dsdojo_db
Done.
Done.

[]

In [122]:
%%sql

COPY product_full FROM '/tmp/data/S_product_full_UTF-8_header.tsv' 
WITH CSV HEADER DELIMITER E'\t' encoding 'UTF-8'

 * postgresql://padawan:***@db:5432/dsdojo_db
10030 rows affected.

[]

In [123]:
%%sql

SELECT * FROM product_full LIMIT 3

 * postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('P040101001', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 198, 149),
 ('P040101002', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 218, 164),
 ('P040101003', '04', '惣菜', '0401', '御飯類', '040101', '弁当類', 230, 173)]

# これで１００本終わりです。おつかれさまでした！